// 公共数据
/*--------------------------------------------------------*/
/*   
    鼠标信息
        pX                  鼠标的横坐标
        pY                  鼠标的纵坐标
*/
var pX = 0;
var pY = 0;
/*--------------------------------------------------------*/
/*--------------------------------------------------------*/
/*
    初始化数据
        wallSize            墙的大小
        count               计算
*/
var wallSize = 36;
var count = 0;
/*--------------------------------------------------------*/
/*--------------------------------------------------------*/
/*
    蛇信息
********每个节点都有的属性**************
        snakeLength         蛇的身长(不包括蛇头)
        snakeSize           每一个蛇节大小
        pointSpace          蛇节点间的距离
        snakeSpeed          蛇移动速度(必须能被蛇间距整除)
***************************************
********单个节点************************
        directionX          蛇头水平移动的方向
        directionY          蛇头竖直移动的方向
        xIncrement          蛇头水平的移动距离
        yIncrement          蛇头竖直的移动距离
        snakeArr            整条蛇的信息(蛇的每一节包括蛇头)
***************************************           
*/
var snakeLength = 15;
var snakeSize = 36;
var pointSpace = 20;
var snakeSpeed = 5;
var xIncrement = 0;
var yIncrement = -snakeSpeed;
var snakeArr = new Array();
/*--------------------------------------------------------*/
/*
    蛇头轨迹
        headLocus           蛇头轨迹
        headlocusIndex      轨迹的索引
*/
var headLocus = new Array();
var headlocusIndex = 0;
// 第一个元素初始化为数组
headLocus[headlocusIndex] = new Array();
/*--------------------------------------------------------*/
/*--------------------------------------------------------*/
/*
    节点的层级              递减的
*/
var zIndex = 999;
/*--------------------------------------------------------*/




